//- Знайти та вивести довижину настипних стрінгових значень

//- Перевести до великого регістру наступні стрінгові значення


//- Перевести до нижнього регістру настипні стрінгові значення

//- Є "брудна" стрінга let str = ' dirty string   ' . Почистити її від зайвих пробілів.

//- Напишіть функцію stringToarray(str), яка перетворює рядок на масив слів.

//- Напишіть функцію delete_characters(str, length), яка повертає підрядок, що складається із зазначеної кількості символів.

//- Напишіть функцію insert_dash(str), яка приймає рядок str як аргумент і вставляє тире (-) між словами. При цьому всі символи рядка необхідно перевести у верхній регістр.

//- Напишіть функцію, яка приймає рядок як аргумент і перетворює регістр першого символу рядка з нижнього регістру у верхній.

//- Напишіть функцію capitalize(str), яка повертає рядок, у якому кожне слово починається з великої літери.

