//- Дано натуральное число n. Выведите все числа от 1 до n.
//let i = 1;
//let num = (n) => {
//    console.log(i);
//    i++;
//    while (i <= n) {
//        arrCreator(n);
//    }
//}
//
//num(5);

//- Даны два целых числа A и В . Выведите все числа от A до B включительно, в порядке возрастания, если A < B, или в порядке убывания в противном случае.
//let ab = (a, b) => {
//    if (a < b) {
//        for (a; a <= b; a++) {
//            console.log(a)
//        }
//    } else if (a > b) {
//        for (a; a >= b; a--) {
//            console.log(a)
//        }
//    }
//}
//
//
//ab(2, 3);


//-   функція Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
//  EXAMPLE:
//  foo([9,8,0,4], 0) // ==> [ 8, 9, 0, 4 ]
//  foo([9,8,0,4], 1) // ==> [ 9 ,0, 8, 4 ]
//  foo([9,8,0,4], 2) // ==> [ 9, 8, 4, 0 ]

//let foo = (arr, i) => {
//    for (let j = 0; j < arr.length; j++) {
//        if (i < arr.length - 1) {
//            if (j === i) {
//                let newItem = arr[j + 1];
//                arr[j + 1] = arr[i];
//                arr[j] = newItem;
//            }
//        }
//    }
//    return arr;
//}
//console.log(foo([9, 8, 0, 4], 0));

//- Сворити функцію яка буде переносити елементи з значенням 0 у кінець маисву. Зберігаючи при цьому порядок не нульових значень.
//Двожина масиву від 2 до 100
//EXAMPLE:
//[1,0,6,0,3] => [1,6,3,0,0]
//[0,1,2,3,4] => [1,2,3,4,0]
//[0,0,1,0]   => [1,0,0,0]

//let zeros = (arr) => {
//    let arr2 = [];
//    for (const item of arr) {
//        if (item !== 0) {
//            arr2.push(item);
//        }
//    }
//    for (const item of arr) {
//        if (item === 0) {
//            arr2.push(item);
//        }
//    }
//    return arr2;
//}
//
//console.log(zeros([0,0,1,0]));
