//Всі функції повинні бути описані стрілочним типом!!!!

//- створити функцію яка обчислює та повертає площу прямокутника висотою
//let sq= (a,b)=>a*b;
//console.log(sq(5, 6));

//- створити функцію яка обчислює та повертає площу кола
//let sq= (r)=>3.14*(r**2);
//console.log(sq(5));

//- створити функцію яка обчислює та повертає площу циліндру
let sq= (h,r)=>2*3.14*h*r;
console.log(sq(5,6));

//- створити функцію яка приймає масив та виводить кожен його елемент


//- створити функцію яка  створює параграф з текстом. Текст задати через аргумент


//- створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий


//- створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)


//- створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список


//- створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.